/*
 * @Author: Day
 * @File: hoisting.js (变量提升)
 * @Date: 2018-08-28 11:30:15
 * @Last Modified by: Day
 * @Last Modified time: 2018-08-28 12:34:20
 */

/**
|--------------------------------------------------
|--------------------------------------------------
|              ### 不存在变量提升 ###
| 1. 变量提升:把变量提升到当前作用域[块作用域当中或者说一个函数]顶端的位置,只是提升变量的声明,并不会将变量的赋值一同提升上来.
| 2. 函数提升:将使用函数声明方式声明的整个函数(包括函数体)都提升到作用域顶端位置。
|     * 函数表达式 var fn=function fn(){}
|     * 函数声明方式 function fn(){code}
|--------------------------------------------------
|--------------------------------------------------
*/

/**
|--------------------------------------------------
| 1. var 命令会发生 "变量提升现象",即变量可以在声明之前使用, 值为 undefined
| 2. let 命令纠正 var 的语法行为,所声明的变量,一定要先声明后使用,否则会报错
| 3. 函数提升只存在于使用函数声明的函数
|--------------------------------------------------
*/

console.log(a) //undefined

var a = 1

// console.log(b) // b is not defined

let b = 2

c(1)

function c(t) {
  console.log(t)
}

console.log(d) //undefined
// d(2)
var d = function(t) {
  console.log(t)
}
