/*
 * @Author: Day
 * @File: scoping.js(作用域)
 * @Date: 2018-08-28 11:31:54
 * @Last Modified by:   Day
 * @Last Modified time: 2018-08-28 11:31:54
 */

/**
|--------------------------------------------------
|--------------------------------------------------
|                 ### 块级作用域 ###
|--------------------------------------------------
|--------------------------------------------------
*/
{
  var a = 1
  let b = 2
}

console.log(a) // 1
// console.log(b) //ReferenceError b is not defined

/**
|--------------------------------------------------
| 1. var 声明的对象全局只有一个,每次赋值更新会全局更改.
| 2. let 声明的对象只在本轮有效,每一次循环的i 都会是一个新变量.
| 3. for 循环时,设置变量部分为父级作用域,循环体内部为单独子作用域.
|--------------------------------------------------
*/

// #1
var a = []
for (var j = 0; j < 10; j++) {
  a[j] = function() {
    console.log(j)
  }
}

a[6]()

// #2
let b = []
for (let i = 0; i < 10; i++) {
  // console.log(i)
  b[i] = function() {
    console.log(i)
  }
}

b[6]()

// #3
for (let i = 0; i < 3; i++) {
  let i = 'y'
  console.log(i)
}
